ut.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_УведомленияПользователя/КонтурЛогистика_УведомленияПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_УведомленияПользователя</name>
  <resources>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПрочтения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Уведомление</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_УведомленияПродукта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь1С</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ut.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_УведомленияПользователя/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура УстановитьПризнакПрочитано(Уведомление, ТекущийПользователь, Прочитано = Истина) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Уведомление.Установить(Уведомление);
	НаборЗаписей.Отбор.Пользователь1С.Установить(ТекущийПользователь);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		ТекущаяЗапись = НаборЗаписей.Добавить();
		ТекущаяЗапись.Уведомление = Уведомление;
		ТекущаяЗапись.Пользователь1С = ТекущийПользователь;
	Иначе
		ТекущаяЗапись = НаборЗаписей[0];
	КонецЕсли;
	
	ТекущаяЗапись.Прочитано = Прочитано;
	ТекущаяЗапись.ДатаПрочтения = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
